# 1. IMDB SQL DB

In [3]:
import pandas as pd
import sqlite3

In [4]:
conn = sqlite3.connect('data/im.db')

In [5]:
cursor = conn.cursor()

In [6]:
schema_df = pd.read_sql("""
SELECT *
FROM sqlite_master

""", conn)

schema_df

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [154]:
movie_akas_query = """
SELECT *
FROM movie_akas
WHERE region = 'US'
"""
df_movie_akas = pd.read_sql(movie_akas_query, conn)
df_movie_akas.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,21,Jurassic World 3D,US,None,None,3-D version,0.0
1,tt0369610,29,Jurassic World,US,None,None,None,0.0
2,tt0369610,2,Ebb Tide,US,None,None,fake working title,0.0
3,tt0369610,36,Jurassic Park IV,US,None,working,None,0.0
4,tt0369610,44,Jurassic Park 4,US,None,None,informal alternative title,0.0

In [152]:
df_movie_akas.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,21,Jurassic World 3D,US,None,None,3-D version,0.0
1,tt0369610,29,Jurassic World,US,None,None,None,0.0
2,tt0369610,2,Ebb Tide,US,None,None,fake working title,0.0
3,tt0369610,36,Jurassic Park IV,US,None,working,None,0.0
4,tt0369610,44,Jurassic Park 4,US,None,None,informal alternative title,0.0

In [155]:
persons_query = """
SELECT *
FROM persons
"""
df_persons = pd.read_sql(persons_query, conn)
df_persons.head()

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"

In [156]:
principals_query = """
SELECT *
FROM principals
"""
df_principals = pd.read_sql(principals_query, conn)
df_principals.head()

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [68]:
df_movie_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51490 entries, 0 to 51489
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           51490 non-null  object
 1   ordering           51490 non-null  int64
 2   title              51490 non-null  object
 3   region             51490 non-null  object
 4   language           548 non-null    object
 5   types              6701 non-null   object
 6   attributes         2458 non-null   object
 7   is_original_title  51485 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 3.1+ MB

In [74]:
test_df = df_movie_akas.join(df_movie_ratings, how='left',  rsuffix='_r')
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51490 entries, 0 to 51489
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           51490 non-null  object
 1   ordering           51490 non-null  int64
 2   title              51490 non-null  object
 3   region             51490 non-null  object
 4   language           548 non-null    object
 5   types              6701 non-null   object
 6   attributes         2458 non-null   object
 7   is_original_title  51485 non-null  float64
 8   movie_id_r         51490 non-null  object
 9   averagerating      51490 non-null  float64
 10  numvotes           51490 non-null  int64
dtypes: float64(2), int64(2), object(7)
memory usage: 4.3+ MB

In [77]:
test_df2 = test_df.join(df_movie_ratings, how='left', rsuffix='_r2')

In [87]:
test_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51490 entries, 0 to 51489
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           51490 non-null  object
 1   ordering           51490 non-null  int64
 2   title              51490 non-null  object
 3   region             51490 non-null  object
 4   attributes         2458 non-null   object
 5   is_original_title  51485 non-null  float64
 6   movie_id_r         51490 non-null  object
 7   averagerating      51490 non-null  float64
 8   numvotes           51490 non-null  int64
 9   movie_id_r2        51490 non-null  object
 10  averagerating_r2   51490 non-null  float64
 11  numvotes_r2        51490 non-null  int64
dtypes: float64(3), int64(3), object(6)
memory usage: 4.7+ MB

In [81]:
test_df2.drop(labels='language', axis=1, inplace=True)

In [84]:
test_df2.drop(labels='types', axis=1, inplace=True)

KeyError: "['types'] not found in axis"

In [88]:
test_df2.drop(labels='attributes', axis=1, inplace=True)

In [89]:
test_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51490 entries, 0 to 51489
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           51490 non-null  object
 1   ordering           51490 non-null  int64
 2   title              51490 non-null  object
 3   region             51490 non-null  object
 4   is_original_title  51485 non-null  float64
 5   movie_id_r         51490 non-null  object
 6   averagerating      51490 non-null  float64
 7   numvotes           51490 non-null  int64
 8   movie_id_r2        51490 non-null  object
 9   averagerating_r2   51490 non-null  float64
 10  numvotes_r2        51490 non-null  int64
dtypes: float64(3), int64(3), object(5)
memory usage: 4.3+ MB

In [90]:
test_df2.head()

,movie_id,ordering,title,region,is_original_title,movie_id_r,averagerating,numvotes,movie_id_r2,averagerating_r2,numvotes_r2
0,tt0369610,21,Jurassic World 3D,US,0.0,tt10356526,8.3,31,tt10356526,8.3,31
1,tt0369610,29,Jurassic World,US,0.0,tt10384606,8.9,559,tt10384606,8.9,559
2,tt0369610,2,Ebb Tide,US,0.0,tt1042974,6.4,20,tt1042974,6.4,20
3,tt0369610,36,Jurassic Park IV,US,0.0,tt1043726,4.2,50352,tt1043726,4.2,50352
4,tt0369610,44,Jurassic Park 4,US,0.0,tt1060240,6.5,21,tt1060240,6.5,21

In [157]:
known_for_query = """
SELECT *
FROM known_for
"""
df_known_for = pd.read_sql(known_for_query, conn)
df_known_for.head()

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

In [158]:
directors_query = """
SELECT *
FROM directors
"""
df_directors = pd.read_sql(directors_query, conn)
df_directors.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [159]:
writers_query = """
SELECT *
FROM writers
"""
df_writers = pd.read_sql(writers_query, conn)
df_writers.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

In [160]:
movie_basics_query = """
SELECT *
FROM movie_basics
"""
df_movie_basics = pd.read_sql(movie_basics_query, conn)
df_movie_basics.shape

(146144, 6)

In [161]:
df_movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [52]:
movie_ratings_query = """
SELECT *
FROM movie_ratings
"""
df_movie_ratings = pd.read_sql(movie_ratings_query, conn)
df_movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

# 2. CSV Files

In [165]:
df_tmdb = pd.read_csv('data/tmdb.movies.csv.gz', encoding='UTF-8')

In [146]:
df_tmdb['Release_Date_Time'] = pd.to_datetime(df_tmdb['release_date'])

In [147]:
df_tmdb['Year'] = pd.to_datetime(df_tmdb['Release_Date_Time']).dt.year

In [166]:
df_tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [39]:
df_tmdb.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [40]:
df_tmdb['original_language'].value_counts()

en    23291
fr      507
es      455
ru      298
ja      265
      ...
dz        1
si        1
hz        1
nb        1
xh        1
Name: original_language, Length: 76, dtype: int64

In [167]:
df_budgets = pd.read_csv('data/tn.movie_budgets.csv.gz', encoding='UTF-8')

In [168]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [149]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
 6   Release_Date_Time  5782 non-null   datetime64[ns]
 7   Year               5782 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 361.5+ KB

In [164]:
df_bom = pd.read_csv('data/bom.movie_gross.csv.gz')
df_bom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [18]:
df_budgets['release_date'].value_counts().head(10)

Dec 31, 2014    24
Dec 31, 2015    23
Dec 31, 2010    15
Dec 31, 2008    14
Dec 31, 2012    13
Dec 31, 2009    13
Dec 31, 2013    13
Dec 31, 2011    11
Oct 8, 2010      9
Oct 10, 2014     9
Name: release_date, dtype: int64

In [ ]:
df_budgets.drop()

# 3. Name of each DF:

### IMDB DB File:
- df_persons
- df_principals
- df_known_for
- df_directors
- df_writers
- df_movie_basics
- df_movie_ratings
- df_movie_akas

### Other .CSV & .tsv
- df_tmdb
- df_budgets

In [133]:
test_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51490 entries, 0 to 51489
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           51490 non-null  object
 1   ordering           51490 non-null  int64
 2   title              51490 non-null  object
 3   region             51490 non-null  object
 4   is_original_title  51485 non-null  float64
 5   movie_id_r         51490 non-null  object
 6   averagerating      51490 non-null  float64
 7   numvotes           51490 non-null  int64
 8   movie_id_r2        51490 non-null  object
 9   averagerating_r2   51490 non-null  float64
 10  numvotes_r2        51490 non-null  int64
dtypes: float64(3), int64(3), object(5)
memory usage: 4.3+ MB

In [135]:
df_budgets['Release_Date_Time'] = pd.to_datetime(df_budgets['release_date'])

In [137]:
df_budgets['Year'] = df_budgets['Release_Date_Time'].dt.year

In [138]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Release_Date_Time,Year
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009-12-18,2009
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011-05-20,2011
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019-06-07,2019
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015-05-01,2015
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017-12-15,2017

In [141]:
test_df2.head()

,movie_id,ordering,title,region,is_original_title,movie_id_r,averagerating,numvotes,movie_id_r2,averagerating_r2,numvotes_r2
0,tt0369610,21,Jurassic World 3D,US,0.0,tt10356526,8.3,31,tt10356526,8.3,31
1,tt0369610,29,Jurassic World,US,0.0,tt10384606,8.9,559,tt10384606,8.9,559
2,tt0369610,2,Ebb Tide,US,0.0,tt1042974,6.4,20,tt1042974,6.4,20
3,tt0369610,36,Jurassic Park IV,US,0.0,tt1043726,4.2,50352,tt1043726,4.2,50352
4,tt0369610,44,Jurassic Park 4,US,0.0,tt1060240,6.5,21,tt1060240,6.5,21

In [139]:
test_df3 = test_df2.merge(df_budgets, how='inner', left_on='title' , right_on='movie')

In [140]:
test_df3.shape

(2316, 19)

In [132]:
test_df3.head()

,movie_id,ordering,title,region,is_original_title,movie_id_r,averagerating,numvotes,movie_id_r2,averagerating_r2,numvotes_r2,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Release_Date_Time
0,tt0369610,29,Jurassic World,US,0.0,tt10384606,8.9,559,tt10384606,8.9,559,34,"Jun 12, 2015",Jurassic World,"$215,000,000","$652,270,625","$1,648,854,864",2015-06-12
1,tt0401729,2,John Carter,US,0.0,tt1130982,6.4,571,tt1130982,6.4,571,14,"Mar 9, 2012",John Carter,"$275,000,000","$73,058,679","$282,778,100",2012-03-09
2,tt1014759,37,Alice in Wonderland,US,0.0,tt1171222,5.1,8296,tt1171222,5.1,8296,51,"Mar 5, 2010",Alice in Wonderland,"$200,000,000","$334,191,110","$1,025,491,110",2010-03-05
3,tt1014759,37,Alice in Wonderland,US,0.0,tt1171222,5.1,8296,tt1171222,5.1,8296,60,"Jul 28, 1951",Alice in Wonderland,"$3,000,000",$0,$0,1951-07-28
4,tt1926979,1,Alice in Wonderland,US,0.0,tt1774499,6.3,10,tt1774499,6.3,10,51,"Mar 5, 2010",Alice in Wonderland,"$200,000,000","$334,191,110","$1,025,491,110",2010-03-05

In [119]:
test_df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2316 entries, 0 to 2315
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           2316 non-null   object
 1   ordering           2316 non-null   int64
 2   title              2316 non-null   object
 3   region             2316 non-null   object
 4   is_original_title  2316 non-null   float64
 5   movie_id_r         2316 non-null   object
 6   averagerating      2316 non-null   float64
 7   numvotes           2316 non-null   int64
 8   movie_id_r2        2316 non-null   object
 9   averagerating_r2   2316 non-null   float64
 10  numvotes_r2        2316 non-null   int64
 11  id                 2316 non-null   int64
 12  release_date       2316 non-null   object
 13  movie              2316 non-null   object
 14  production_budget  2316 non-null   object
 15  domestic_gross     2316 non-null   object
 16  worldwide_gross    2316 non-null   object
dtypes: float64(3), int64(4), object(10)
memory usage: 325.7+ KB

In [142]:
test_df3.drop_duplicates(subset=['movie','title'], inplace=True)

In [143]:
test_df3.shape

(1799, 19)

In [122]:
test_df3.drop_duplicates(subset=['movie_id'], inplace=True)

In [123]:
test_df3.shape

(1791, 17)

In [110]:
test_df3.head()

,movie_id,ordering,title_x,region,is_original_title,movie_id_r,averagerating,numvotes,movie_id_r2,averagerating_r2,...,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title_y,vote_average,vote_count
0,tt0369610,29,Jurassic World,US,0.0,tt10384606,8.9,559,tt10384606,8.9,...,14193,"[28, 12, 878, 53]",135397,en,Jurassic World,20.709,2015-06-12,Jurassic World,6.6,14056
1,tt0401729,2,John Carter,US,0.0,tt1130982,6.4,571,tt1130982,6.4,...,5197,"[28, 12, 878]",49529,en,John Carter,18.549,2012-03-09,John Carter,6.1,3338
2,tt1014759,37,Alice in Wonderland,US,0.0,tt1171222,5.1,8296,tt1171222,5.1,...,11,"[10751, 14, 12]",12155,en,Alice in Wonderland,22.020,2010-03-05,Alice in Wonderland,6.6,8713
10,tt1194173,9,The Bourne Legacy,US,0.0,tt1229238,7.4,428142,tt1229238,7.4,...,5200,"[28, 53]",49040,en,The Bourne Legacy,18.050,2012-08-10,The Bourne Legacy,6.1,3630
11,tt1210047,4,Snatched!,US,0.0,tt1243974,5.4,54646,tt1243974,5.4,...,2444,[],382715,en,Snatched!,0.600,2010-07-06,Snatched!,1.0,2

In [111]:
test_df3['movie_id'].value_counts()

tt2473762    1
tt2784156    1
tt1680311    1
tt1744850    1
tt4401704    1
            ..
tt6529772    1
tt1223236    1
tt1407055    1
tt2560130    1
tt3203290    1
Name: movie_id, Length: 10585, dtype: int64

## Notes for dr_rt_info.info()

- There are a ton of null values for currency, box_office, and runtime

In [42]:
df_rt_info['writer'].value_counts()

Woody Allen                               4
Hong Sang-soo                             3
John Hughes                               3
Sylvester Stallone                        3
Jim Jarmusch                              3
                                         ..
Mike White|Kay Cannon                     1
Jing Wong                                 1
George Lucas|Gloria Katz|Willard Huyck    1
Charles Burnett                           1
Stuart Gillard|Joe Batteer                1
Name: writer, Length: 1069, dtype: int64

#### note: not a lot of individual writers to go off of, but ithere are some multiple writer categories that I'm going to look into

In [43]:
df_rt_info['director'].value_counts()

Steven Spielberg                                        10
Clint Eastwood                                           8
Ridley Scott                                             4
Jim Jarmusch                                             4
Alfred Hitchcock                                         4
                                                        ..
Richard Spence                                           1
Oktay Ortabasi                                           1
Seijun Suzuki                                            1
Charles Burnett                                          1
Hironobu Sakaguchi|Motonori Sakakibara|Jack Fletcher     1
Name: director, Length: 1125, dtype: int64

In [44]:
df_rt_info.groupby(by='director').count()

,id,synopsis,rating,genre,writer,theater_date,dvd_date,currency,box_office,runtime,studio
director,,,,,,,,,,,
Abel Ferrara,2,2,2,2,2,2,2,0,0,2,0
Adam Ravetch|Sarah Robertson,1,1,1,1,1,1,1,1,1,1,1
Adam Shankman,1,1,1,1,1,1,1,1,1,1,1
Adam Silver|Ben Hayflick,1,1,1,1,1,1,1,0,0,1,0
Aditya Chopra,1,1,1,1,1,1,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...
Youssef Delara,1,1,1,1,1,1,1,1,1,1,0
Yves Simoneau,1,1,1,1,1,1,1,0,0,1,0
Zak Penn,1,1,1,1,1,1,1,0,0,1,1
Zeresenay Berhane Mehari,1,1,1,1,1,0,0,0,0,1,1
Zhang Jun Zhao,1,1,1,1,0,0,0,0,0,1,0